Autodesk.Revit.DB.ViewSheet.SheetTitleBlockId
The Id of the title block this sheet is associated with.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null